       $set sourceformat "FREE"
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHORTEST.

       PROCEDURE DIVISION.
       DisplayPrompt.
           DISPLAY "I did it.".
           stop run.
       